define n = Character(None, kind=nvl)

define Sergey = Character("Серый", color="#c6c6c6")
define Semen = Character("Сёма", color="#ffcccc")

label start:
    show black

    n "Чувствую собственное дыхание."
    nvl clear

    n "Через закрытые глаза ощутимо бьёт свет." with Dissolve (0.5)
    nvl clear
    n "В точности не знаешь чего ждать, если откроешь глаза. Можно лишь полагаться на ощущения." with Dissolve (0.5)
    nvl clear
    n "Возможно, застанешь комнату, залитую солнечными лучами после полуденного сна." with Dissolve (0.5)
    nvl clear
    n "А может пасмурное, дождливое эхо, пробивающееся с улицы через окно еле слышимой моросью." with Dissolve (0.5)
    nvl clear
    n "Я заметил, что сейчас лежу и прислушиваюсь к звукам вокруг себя. И точно не хотелось бы услышать дождь." with Dissolve (0.5)
    nvl clear
    n " Но звуков нет вообще..." with Dissolve (0.5)
    nvl clear
    n "Хотя нет! Чувствуется только, будто давящий на голову низкий шум." with Dissolve (0.5)
    nvl clear
    n "Он как напряжение, бегущее по сосудам моей головы - пытается заполнить каждый её уголок и от того становится всё громче." with Dissolve (0.5)
    nvl clear
    n "Всё мощнее." with Dissolve (0.5)
    nvl clear
    n "Вообще в моей квартире нечему гудеть. Даже прислонившись ухом к телевизору, не получился бы такой глубокий и обволакивающий всё пространство шум." with Dissolve (0.5)
    nvl clear
    n "Теперь его громкость кажется нормой для футбольного матча, собравшего полные трибуны." with Dissolve (0.5)
    nvl clear
    n "Или большого завода, но уж точно не для моей маленькой квартиры." with Dissolve (0.5)
    nvl clear
    n "С каждой секундой ощущается, как любопытство растёт быстрее страха" with Dissolve (0.5)
    nvl clear
    n " и сейчас возможно - точка невозврата." with Dissolve (0.5)
    nvl clear
    n "Неожиданно яркий, но мягкий свет заливает зрачки, что на миг вводит меня в замешательство." with Dissolve (0.5)
    nvl clear
    n "На этом аттракцион иллюзий не заканчивается и появляется новая странная метаморфоза..." with Dissolve (0.5)
    nvl clear
    n "всё мое зрение будто сузилось в одной большой, голубовато-белой точке. Вокруг этой самой точки очень темно." with Dissolve (0.5)
    nvl clear
    n "Чувствуется, что если это сон, то любая мысль сможет воплотиться тут." with Dissolve (0.5)
    nvl clear
    n "Даже самая неприятная или пугающая." with Dissolve (0.5)
    nvl clear
    n "А круг, как единственная видимая материя или портал родит, пропустит через себя и материализует эти страхи." with Dissolve (0.5)
    nvl clear
    n "Но было всё также тихо. Никаких ползущих ко мне, верхних половин зомби, и не соизмеримого размером Ктулху из недавно прочитанной книги Лавкрафта." with Dissolve (0.5)
    nvl clear
    n "Даже банальной стайки худых и изувеченных голодом волков с их диким оскалом." with Dissolve (0.5)
    nvl clear
    n "Так это сон или нет?" with Dissolve (0.5)
    nvl clear
    n "В друг гул исчезает, а зрение становится резким до боли в голове." with Dissolve (0.5)
    nvl clear
    n "Моё лицо залило нежным лунным светом, сосредоточившимся и отражавшимся от моих глаз." with Dissolve (0.5)
    nvl clear
    n "Точнее, я скорее чувствствую как он входит в зрачки, доходя до мозга и выходит тем же путём." with Dissolve (0.5)
    nvl clear
    n "Как бы странно это не ощущалось, но почему-то только недавно царившие в моей голове тревога и хаос, сняло как рукой." with Dissolve (0.5)
    nvl clear
    n "НА ЕДИНЕ С ЛУНОЙ Я ЧУВСТВУЮ, ЧТО ВИЖУ ЭТО НЕ СПРОСТА." with Dissolve (0.5)
    nvl clear
    n "ОНА КАК ЗНАМЕНИЕ ЧЕГО-ТО ДАЛЁКОГО, ШЕПЧЕТ СВОИМ БЛЕДНЫМ, ПРЕКРАСНЫМ БЛЕСКОМ. А Я БУДТО ИЗБРАННЫЙ ЕЙ - ПОНИМАЮ И ЗАСЛУЖИВАЮ ЕЁ ДОВЕРИЯ." with Dissolve (0.5)
    nvl clear
    n "МОЖЕТ ЛУНА ПРИШЛА МЕНЯ О ЧЁМ-ТО ПРЕДУПРЕДИТЬ?" with Dissolve (0.5)
    nvl clear
    n "В голове случается маленькая вспышка отчётливо отпечатав в мыслях слова:" with Dissolve (0.5)
    nvl clear
    n "'А, вдруг, вчера я был другим, и только сейчас стал собой.'" with Dissolve (0.5)
    nvl clear
    n "И теперь могу принять 'вызов', которого так долго ждал" with Dissolve (0.5)
    nvl clear
    n "Потихоньку сознание созревает в моей голове вместе с вопросом 'Где я?'" with Dissolve (0.5)
    nvl clear
    n "Я не успеваю осмыслить свой внутренний вопрос, как разум ускользает от меня вместе с таинственной силой, замеченной только будучи покинувшей тело" with Dissolve (0.5)
    nvl clear
    n "... и вновь возвращается показывая до боли знакомый двор..." with Dissolve (0.5)
    nvl clear
    n "знакомый дом." with Dissolve (0.5)
    nvl clear
    n " Я разочарован и осознаю, что это всё - лишь приятный, будоражащий сон." with Dissolve (0.5)
    nvl clear
    n "Не смотря на это, всё же осталась надежда ещё хотя бы на секунду ощутить эту силу." with Dissolve (0.5)
    nvl clear
    n "Отдаться ей." with Dissolve (0.5)
    nvl clear
    n "Но возможно ли это, когда в этом сне сознание и воля не одно целое, а два противовеса?" with Dissolve (0.5)
    nvl clear
    n "Я чувствую, что мне надо проснуться не смотря на желание остаться и вернуться обратно." with Dissolve (0.5)
    nvl clear


    show screen rooms_parallax_screen with Dissolve (3.5)
    pause








    return
